{"key":"","content":"<p>This is a practical short article that notes the importance of reproducibility in neuroimaging and the current limitations of the field, before giving some concrete recommendations for how to improve the situation. As someone who is trying to move to being an 'open data' scientist I found it a very useful resource, even though my data is not in the field of fMRI.&nbsp;<br \/>I&nbsp;<br \/>I was asked to comment on how this piece should be classified, whether as a commentary or as a review. I don&rsquo;t think it readily fits either category, but probably is closer to review than commentary, since it goes beyond critique to give an overview of some methods. The headings are not those in author guidelines but do seem appropriate.&nbsp;<br \/><br \/>My comments are mainly minor suggestions to improve the English (as given below), plus a handful of suggestions that would come under 'minor' or 'discretionary revisions' that the authors can be trusted to make. There are no 'major compulsory' revisions.&nbsp;<br \/><br \/>1. Paragraph 1 of the Introduction section could possibly be cut.&nbsp;<br \/>2. It might be worth also stating that there are benefits to the researcher themselves in making data available, because it creates a well-documented long-term record of an experiment that has permanence. This was a point that struck me forcibly when I started exploring possibilities for archiving my own data &ndash; I had a lot of previous data that was now inaccessible because stored on an outdated format (floppy disks!) or where I'd forgotten what variables were, etc. etc. This point is alluded to on p 4, line 19, but I think could be emphasised in the introduction.&nbsp;<br \/>3. P 2 para 2. \"Reproduction is the only way.\" I'm not sure that is true. I see reproduction as an important way, but not the only one. (And bearing in mind that there are sciences, like astronomy, where replication is seldom possible). Indeed, the authors consider preregistration as a complementary approach at the end of the paper.&nbsp;<br \/>4. The structure of the article is a bit odd. The five easy tips make for an easy-to-follow logic, but the \"Tips for more reliable and replicable code\" then seems like a bit of an afterthought. I wonder whether it would work better if the latter section were integrated with the prior material, either by adding a further category, or incorporating the material in the five steps. I suggest numbering the five steps as well.<br \/>The wording of the 'five steps' oscillates between description and command. Better to stick to one style throughout.&nbsp;<br \/>5. The order of the five steps would work better for me if it went: 1) Sharing protocols; 2) sharing analysis scripts; 3) organising \/sharing data; 4) make derived data available and 5) Publishing&nbsp;<br \/>Also this order would group together the two steps that involve sharing of code &ndash; may be possible then to incorporate tips for reliable\/replicable code here.&nbsp;<br \/>6. Under sharing protocols might want to include sharing of stimuli and advise where this could be done.&nbsp;<br \/>7. Not sure if it is also worth touching on a major reason people put forward for not sharing, which is point ii); often there is a concern that others will use one's hard-won data to do other analyses and grab easy glory. That gets into quite complicated areas about whether and how to restrict secondary usage of data.&nbsp;<br \/>Related issue in p 3 para 3, where describing need to provide 'subject information'. Another major reason people don't deposit data is because of confidentiality issues, often citing restrictions imposed by Ethics Committees (IRBs). Worth stating, perhaps, that this issue should be anticipated when seeking Ethics approval, so that permission is given for anonymised data to be shared.&nbsp;<br \/>8. Reflecting on this, I wonder whether you might add an initial, more generic point to the '5 easy steps' which is 'plan ahead'. The point about things being much easier if formatted appropriately for an archive is key, and should influence earlier stages including how programs are written to generate raw data and results of analyses.&nbsp;<br \/>9. While I think it is worth mentioning preregistration, I did not find this account (on p 7) very clear and wondered whether it should be omitted &ndash; maybe just flagging up in the introduction that preregistration is a complementary approach to improving reproducibility, and providing a reference. Preregistration is quite a highly charged topic in this field, with the debate between Kanai and Wagenmakers on Neuroskeptic's blog providing a great deal of interest: <a href=\"http:\/\/blogs.discovermagazine.com\/neuroskeptic\/2014\/11\/19\/reality-check-neuroscience\/#.VGzzUWLuBZQ.twitter\" target=\"_blank\">http:\/\/blogs.discovermagazine.<wbr \/>com\/neuroskeptic\/2014\/11\/19\/<wbr \/>reality-check-neuroscience\/#.<wbr \/>VGzzUWLuBZQ.twitter<\/a>. Kanai pushing the argument that pre-registration can be a bad thing if it reduces flexibility and hence leads to non-replication. That post raises weighty issues but my advice would be to leave this for another paper, as it merits a more detailed evaluation.&nbsp;<br \/><br \/>Line by line comments (Line numbers obtained from Word version with auto line numbers)&nbsp;<br \/>The initial quote from Galton is very nice!&nbsp;<br \/>P 1, line 21 every -&gt; all&nbsp;<br \/>P 2, line 11, delete 'of the'&nbsp;<br \/>P 2, line 15 \"Replications are not boring\" &ndash; seems too subjective a statement&nbsp;<br \/>P 2 line 16; mixed case for pronoun. Suggest one -&gt; we&nbsp;<br \/>P 2, para 2, last sentence; I think could be omitted&nbsp;<br \/>P 2, line 23 majority -&gt; part&nbsp;<br \/>P 2 line 26, use -&gt; used&nbsp;<br \/>P 2, line 28, alone -&gt; be sufficient to&nbsp;<br \/>P 2 , line 31, better -&gt; improve&nbsp;<br \/>P 2, line 35, well -&gt; readily&nbsp;<br \/>P 2, line 37, extend -&gt; extent&nbsp;<br \/>P 3, line 7 \"such details can determine whether an effect is observed or not.\"&nbsp;<br \/>P 3, line 8, re-use -&gt; reproduce&nbsp;<br \/>P 3, line 11-12; when describing Repositories the focus is on sharing data, whereas the protocols section is more to do with sharing procedures.&nbsp;<br \/>P 3, line 15, 'their comparison' -&gt; 'a comparison'&nbsp;<br \/>P 3, line 16-17 &ndash; not clear what is meant here by 'beyond the significant results'. Do you mean you'd want to check that means, etc are in the same range. That does seem to be a kind of check that is important but which people do surprisingly rarely.&nbsp;<br \/>P 3, line 18; 'aggregate them to' -&gt; 'aggregate them with' (sounds more natural to my English ear).&nbsp;<br \/>P 3, line 18. \"Most funders now request that data are made available, and researchers must be prepared to do this and to identify where the data will be archived.\"&nbsp;<br \/>P 3, line 26, 'by request' -&gt; 'on request'.&nbsp;<br \/>P 3, I'm curious as to the reason why additional datasets have not been added to the fMRI data center&nbsp;<br \/>P 3, line 29, delete 'most'&nbsp;<br \/>P 3, line 31, I think sentence starting 'In addition' is redundant and could be deleted&nbsp;<br \/>P 4, line 22. Reword to \"Sandve et al (2013) have a few simple recommendations.\"&nbsp;<br \/>P 4, line 23, \"keep track of every step\"&nbsp;<br \/>P 4 , line 24-25 \"Most neuroimaging software has so-called batch mode&hellip;. or is made from scripts.\"&nbsp;<br \/>P 4, line 30; \"a random number generator\"&nbsp;<br \/>P 4, line 38-39. \"reuse scripts on new data\". Full stop after 'protocol', delete 'or else &ndash; and' . New sentence starting 'Similar'&nbsp;<br \/>P 4, line 40 analyses -&gt; analysis&nbsp;<br \/>P 5, line 7, \"would allow judging if\" -&gt; \"makes it possible to judge whether\"&nbsp;<br \/>P 5, line 8 not clear what is meant by \"and the actual field of view\"&nbsp;<br \/>P 5, line 10, 'their limitation' -&gt; limitations&nbsp;<br \/>P 5, line 12, sentence starting \"Yet statistical results&hellip;\" is hard to understand.&nbsp;<br \/>P 5, line 17, \"allows judging of\" -&gt; \"allows one to judge \"&nbsp;<br \/>P 5, line 18 this sentence rather unclear; is one judging the likelihood of (the significance and sparsity) or (the likelihood of the significance) and (the likelihood of the sparsity)&nbsp;<br \/>P 5, line 29, \"such as\" -&gt; \"so that\"&nbsp;<br \/>P 5, line 32, \"allows one to judge the robustness\"&nbsp;<br \/>P 5, para 3. This paragraph changes into the imperative, which sounds odd, as previous paragraphs were descriptive&nbsp;<br \/>P 6, line 2, \"each analysis step\"&nbsp;<br \/>P 6, line 6, \"Barriers to code-sharing\"&nbsp;<br \/>P 6, line 7, \"Researchers are often concerned that their code is too poor\"&nbsp;<br \/>P 6, line 11, \"make a workflow\" (?)&nbsp;<br \/>P 6, line 13, should Python be capitalised?&nbsp;<br \/>P 6, line 16 'better'-&gt; 'improve'&nbsp;<br \/>P 6, line 17, comma after 'scripts'&nbsp;<br \/>P 6, line 25. 'incentives'&nbsp;<br \/>P 6, line 31, delete 'today' and delete comma&nbsp;<br \/>P 6, line 33, 'need however to train others'&nbsp;<br \/>P 6, line 33, \"a much more systematic manner than is currently done\"&nbsp;<br \/>P 6, line 35, 'are lacking' -&gt; 'lack'&nbsp;<br \/>P 6, line 36, date only in brackets for Piwowar et al&nbsp;<br \/>P 7, line 3 , \"associated with\"&nbsp;<br \/>P 7, line 3, \"is likely to have as many benefits as sharing data or publications\"&nbsp;<br \/>P 7, line 12, \"its chance to be replicated\" &ndash; unclear. \"The likelihood that it will be replicated\" (?)&nbsp;<br \/>P 7, line 15, \"Contrary to what has been claimed\" &ndash; unclear who has claimed this.&nbsp;<br \/>P 7, line 19, \"Such practice doesn't have to be always&hellip;\" again, rather unclear.&nbsp;<br \/><br \/><br \/><br \/><strong>Level of interest<\/strong>&nbsp;An article of importance in its field<br \/><strong>Quality of written English<\/strong>&nbsp;Needs some language corrections before being published<br \/><strong>Declaration of competing interests<\/strong>&nbsp;I declare that i have no competing interests<\/p> <br \/><div>The reviewed version of the manuscript can be seen here: <br \/>http:\/\/www.gigasciencejournal.com\/imedia\/1692915561155108_manuscript.pdf <br \/> All revised versions are also available: <br \/>Draft - http:\/\/www.gigasciencejournal.com\/imedia\/1692915561155108_manuscript.pdf <br \/>First revision - http:\/\/www.gigasciencejournal.com\/imedia\/1248589054163796_manuscript.pdf <br \/><\/div>","reviewer":{"name":"Dorothy Bishop","email":"dorothy.bishop@psy.ox.ac.uk"},"publication":{"title":"<p>Improving functional magnetic resonance imaging reproducibility.<\/p>","doi":"10.1186\/s13742-015-0055-8"},"complete_date":{"month":"01","year":"2015"},"url":"http:\/\/www.gigasciencejournal.com\/imedia\/1504549979155713_comment.pdf"}
